---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTriserTreadNumber
source: html/1b8db332-20c8-47e7-4457-b83dfcddb43c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTriserTreadNumber Property

"Tread Number": Count the sequential number of tread in the stair.

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTriserTreadNumber { get; }
```